Vel11leV/testTask_STM32/Src/main.c
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2020 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"

/* USER CODE BEGIN Includes */
#include <stdlib.h>
#include <string.h>
#include "BMP280/bmp280.h"
#include "MQTTPacket/src/MQTTPacket.h"



#define STRLEN(STR)  sizeof(STR)/sizeof(uint8_t)
#define ESPBUF       1000
#define SIZEUART1RES 1
#define SIZEUART2RES 1
#define ATSENDSIZE   48

#define SSID       "summer"
#define PASS       "Milan2019"
#define SERVERURL  "quickstart.messaging.internetofthings.ibmcloud.com"
#define TCPPORT    "1883"
#define MQTTTOPIC  "iot-2/evt/status/fmt/json"
#define MQTTID     "d:quickstart:arduino:6001941ce5bf"


/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart1_rx;
DMA_HandleTypeDef hdma_usart2_rx;

osThreadId defaultTaskHandle;
osThreadId myTask02Handle;
osMutexId dataMutex01Handle;
osMutexId uart2Mutex02Handle;

////////////////////bmp280////////////////////////
BMP280_HandleTypedef bmp280;
/////////////////////end_bmp280///////////////////
float pressure, temperature, humidity;
uint16_t size;
uint8_t Data[256];
uint8_t AT_SSID_CON_[100];
uint8_t AT_CONNECT_TO_SERVER_[100];



/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
uint8_t espReply[ESPBUF];
uint16_t espCount=0;


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_I2C1_Init(void);
void sensorThread1(void const * argument);
void serverThread2(void const * argument);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/


int8_t  uintToString(uint16_t value, uint8_t *buffer, uint8_t lengthOfint) //buff =3!!!
{
  if(buffer==NULL) return -1;
   
if(lengthOfint==8)  //  uint8_t
    {    
        int i =2;
       do
       {
          buffer[i] = value % 10 + '0';
          value /= 10;
           i--;
       }
       while (value != 0);
       return 3; //string length 3
    }
    
    
else if (lengthOfint==16) //  uint16_t
    {
         int i = 10;
       do
       {
          buffer[i] = value % 10 + '0';
          value /= 10;
           i--;
       }
       while (value != 0);
       return 11;  //string length 11
    }


}

void strSendUART1 (uint8_t *str, uint16_t theStrlen )
{  
   if(str==NULL) return; 
    
   if(*str!=NULL)
   HAL_UART_Transmit(&huart1,str, theStrlen,10);
}
void strSendUART2 (uint8_t *str, uint16_t theStrlen )
{   
   if(str==NULL) return; 
    
   if(*str!=NULL)
   HAL_UART_Transmit(&huart2,str,theStrlen,10);
}

void espReplyNewData(uint8_t chr)
{ 
 
    
    if (espCount<ESPBUF)
    {
        espReply[espCount] = chr;
        espCount++;
    }
    else
    {
        espCount=0;
        espReply[espCount] = chr;
        espCount++;
    }
    

}

void espReplyToUART2()
{   
   

    
    int dataSizeInBuffer = 0;
    for(int i=0;i<ESPBUF;i++)
    {
        if(espReply[i]!=NULL)
            dataSizeInBuffer++;
        else break;
    }
    strSendUART2(espReply,dataSizeInBuffer); 
    

