Vel11leV/testTask_STM32/Src/main.c
}

/* USER CODE BEGIN 4 */

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(huart);
    
    if(huart==&huart1)
    {
     
        //strSendUART2(myDataRX1,STRLEN(myDataRX1));       
           espReplyNewData(*myDataRX1); 
    
    }
    if(huart==&huart2)
    {
              
    }
  
  /* NOTE: This function Should not be modified, when the callback is needed,
           the HAL_UART_TxCpltCallback could be implemented in the user file
   */
}

/* USER CODE END 4 */

/* sensorThread1 function */
void sensorThread1(void const * argument)
{
////////////////////bmp280/////////////////////
SensorBMP280Initialization( &bmp280, &hi2c1, &huart2, Data, size  ); 
//////////////////end_bmp280///////////////////////    
    
  for(;;)
  {
///////////////////bmp280//////////////////////    
osMutexWait(uart2Mutex02Handle, osWaitForever);       
    SensorBMP280GetData(&bmp280, &hi2c1,&huart2, Data, size, &temperature, &pressure, &humidity);
osMutexRelease(dataMutex01Handle);
/////////////////end_bmp280////////////////////////  
      
    osDelay(100);
  }
  /* USER CODE END 5 */ 
}

/* serverThread2 function */
void serverThread2(void const * argument)
{

///////////////////MQTT/////////////////////
 
MQTTPacket_connectData data = MQTTPacket_connectData_initializer;
uint16_t rc = 0;
uint8_t buf[200];
int buflen = sizeof(buf);    
MQTTString topicString = MQTTString_initializer;
uint8_t payload[100];
data.clientID.cstring = MQTTID;
data.keepAliveInterval = 20;
data.cleansession = 1;
topicString.cstring = MQTTTOPIC;
    
//////////////////endMQTT///////////////////
    
    
  /* USER CODE BEGIN serverThread2 */
  /* Infinite loop */
       

    uint8_t AT_RST[]    = "AT+RST\r\n";
    uint8_t AT_CIPMODE[]= "AT+CIPMODE=1\r\n";
    uint8_t AT_CIPSEND[]= "AT+CIPSEND\r\n";
    uint8_t AT_CIFSR[]  = "AT+CIFSR\r\n";
    uint8_t AT_CIPMODECLOSE[3]={'+','+','+'};
    uint8_t AT_CONNECT_TO_SERVER[]=  "AT+CIPSTART=\"TCP\",\"quickstart.messaging.internetofthings.ibmcloud.com\",1883\r\n"; 
    sprintf((char *)AT_SSID_CON_,"AT+CWJAP=\"%s\",\"%s\"\r\n",SSID,PASS);
   
    
    //strSendUART2(AT_SSID_CON_,STRLEN(AT_SSID_CON_));

    
//////////////////////////////////////////    
    ////////////ESP8266 status////////////
    uint8_t _WAIT_WIFI[]      ="connecting to WiFi...\n";
    uint8_t _WAIT_IP[]        ="getting IP...\n";
    uint8_t _WAIT_SERVERCON[] ="Connecting to the server...\n";  
    uint8_t _WIFI_connected[] ="WiFi connected.\n";
    uint8_t _WAIT_CIPMODE[]   ="CIPMODE...\n"; 
    
    ////////////ESP8266 reply////////////
    uint8_t rep_OK[] =     "OK";
    uint8_t rep_STAIP[] =  "STAIP";
    uint8_t rep_CONNECT[]= "CONNECT";
    uint8_t rep_CIPSEND[]= ">";
    uint8_t _WAIT_CIPSEND[] ="SIPMODE ON\n"; 
    uint8_t NEWLINE[] ="\n";
///////////////////////////////////////////    
    

       
/*---------------------ESP8266 setting---------------------*/   

espReplyClear(); 
strSendUART1(AT_CIPMODECLOSE,STRLEN(AT_CIPMODECLOSE));
HAL_Delay(2000);        

    //connectiong to WiFi AP
      espReplyClear();    
      strSendUART1(AT_SSID_CON_,STRLEN(AT_SSID_CON_)-1);
      while(espReplyIsSubstring(rep_OK,STRLEN(rep_OK)-1)==0){ 
            espReplyClear();
            strSendUART1(AT_CIFSR,STRLEN(AT_CIFSR)-1);
            strSendUART2( _WAIT_WIFI,STRLEN( _WAIT_WIFI));
            HAL_Delay(300);         
            }
           

    //GET IP        
    while(espReplyIsSubstring(rep_STAIP,STRLEN(rep_STAIP)-1)==0){ 
            espReplyToUART2();
            espReplyClear();
            strSendUART1(AT_CIFSR,STRLEN(AT_CIFSR));
            strSendUART2(_WAIT_IP,STRLEN(_WAIT_IP));
            HAL_Delay(300);         
            }
    espReplyToUART2();          
    espReplyClear(); 

    
   //set ESP8266 set in CIPMODE (uart<->WiFi)         
   strSendUART1(AT_CIPMODE,STRLEN(AT_CIPMODE)-1);  
   while(espReplyIsSubstring(rep_OK,STRLEN(rep_OK)-1)==0){ 
            strSendUART2(_WAIT_CIPMODE,STRLEN(_WAIT_CIPMODE));
            HAL_Delay(300);         
            }            
   espReplyToUART2();
   espReplyClear();  

/*---------------------endESP8266 setting ---------------------*/  


            


            
  for(;;)
  {
      
     /*---------Connect to the server and transmit the data---------*/
          
    //Connecting to the server           
    strSendUART1(AT_CONNECT_TO_SERVER,STRLEN(AT_CONNECT_TO_SERVER));
    while(espReplyIsSubstring(rep_CONNECT,STRLEN(rep_CONNECT)-1)==0){ 
            strSendUART2(_WAIT_SERVERCON,STRLEN(_WAIT_SERVERCON));
            HAL_Delay(100);         
            }
   espReplyToUART2();
   espReplyClear();  
            
   // CIPMODE (uart<->WiFi) gets ready to start
   strSendUART1(AT_CIPSEND,STRLEN(AT_CIPSEND));  
   while(espReplyIsSubstring(rep_CIPSEND,STRLEN(rep_CIPSEND)-1)==0){ 
            strSendUART2(_WAIT_CIPSEND,STRLEN(_WAIT_CIPSEND));
            HAL_Delay(100);         
            }            
   espReplyToUART2();
   espReplyClear(); //NEWLINE   
   strSendUART2(NEWLINE,STRLEN(NEWLINE));
            
////////////////
osMutexWait(uart2Mutex02Handle, osWaitForever);               
uint16_t payloadlen =sprintf((char *)payload,"{\n\"d\":{\n\"myName\":\"STM32\",\n\"temp (C)\": %.2f\n}\n}",temperature); // 
osMutexRelease(dataMutex01Handle);

            
uint16_t len = MQTTSerialize_connect(buf, buflen, &data); 
len += (uint16_t)MQTTSerialize_publish(buf + len, buflen - len, 0, 0, 0, 0, topicString, payload, payloadlen);
len += MQTTSerialize_disconnect(buf + len, buflen - len);

strSendUART2(NEWLINE,STRLEN(NEWLINE));            
strSendUART2(buf,len); 
strSendUART2(NEWLINE,STRLEN(NEWLINE));
           
   strSendUART1(buf,len);  
   HAL_Delay(200);            
////////////////
     
   strSendUART1(AT_CIPMODECLOSE,STRLEN(AT_CIPMODECLOSE));  //CIPMODE close   
     HAL_Delay(200);    
            
/*---------end Connect to the server and transmit the data---------*/  
 
